// ---1--- перетворити рядок на новий рядок, де кожен символ у новому рядку є, "("якщо цей символ з’являється лише один раз у вихідному рядку або ")"якщо цей символ з’являється більше одного разу у вихідному рядку. Ігноруйте великі літери, коли визначаєте, чи є символ дублікатом.
// const duplicateEncode = (s) =>
//   s.toLowerCase().split``.map((e, _, a) =>
//     a.indexOf(e) === a.lastIndexOf(e) ? "(" : ")"
//   ).join``;
// console.log(duplicateEncode("recede"));
// console.log(duplicateEncode("Success"));
// console.log(duplicateEncode("(( @"));

// ---2---Ваше завдання полягає в тому, щоб реалізувати функцію, яка приймала б азбуку Морзе як вхідні дані та повертала б декодований зрозумілий людині рядок.
// const decodeMorse = function (morseCode) {
//   return morseCode
//     .split("   ")
//     .map((s) => s.split(" "))
//     .map((s) => s.map((s) => MORSE_CODE[s]))
//     .map((s) => s.join(""))
//     .join(" ")
//     .trim();
// };
// console.log(decodeMorse(".... . -.--   .--- ..- -.. ."));
// console.log(decodeMorse("   .... . -.--   "));
// console.log(decodeMorse("...   ---   ..."));
// console.log(
//   decodeMorse(
//     "      ...---... -.-.--   - .... .   --.- ..- .. -.-. -.-   -... .-. --- .-- -.   ..-. --- -..-   .--- ..- -- .--. ...   --- ...- . .-.   - .... .   .-.. .- --.. -.--   -.. --- --. .-.-.-  "
//   )
// );
// ---3---Дано масив цілих чисел, знайдіть те, яке з’являється непарну кількість разів.Завжди буде лише одне ціле число, яке з’являється непарну кількість разів.
// function findOdd(A) {
//   //happy coding!
//   return 0;
// }