// ---1---Напишіть функцію, яка бере масив слів і розбиває їх разом у речення та повертає речення. Ви можете ігнорувати будь-яку необхідність дезінфекції слів або додавання розділових знаків, але ви повинні додавати пробіли між кожним словом. Будьте уважні, не повинно бути пробілів ні на початку, ні в кінці речення!

// function smash(words) {
//   return words.join(" ");
// }
// console.log(smash(["hello", "amazing", "world"]));

// ---2--- У цьому простому завданні вам дано число, і ви повинні зробити його від’ємним. Але, може, число вже негативне?
// function makeNegative(num) {
//   if (num <= 0) return num;
//   return num * -1;
// }
// console.log(makeNegative(42));

// ---3---  Ви знаєте, що в середньому ваш автомобіль проходить близько 25миль на галон. Залишилися 2галони.Враховуючи ці фактори, напишіть функцію, яка повідомляє вам, чи можна дістатися до насоса чи ні.Функція повинна повертатися true, якщо це можливо, а falseякщо ні.
// const zeroFuel = (distanceToPump, mpg, fuelLeft) => {
//   return distanceToPump / mpg <= fuelLeft;
// };
// console.log(zeroFuel(50, 25, 2));

//---4--- Ваше завдання знайти перший елемент масиву, який не є послідовним.Під непослідовним ми маємо на увазі не точно на 1 більший за попередній елемент масиву.Наприклад, якщо у нас є масив [1,2,3,4,6,7,8]then 1then 2then 3then 4усі послідовні, але 6не є, тож це перше непослідовне число.Якщо весь масив є послідовним, повертається null2 .Масив завжди матиме принаймні 2елементи 1 , і всі елементи будуть числами. Усі номери також будуть унікальними та в порядку зростання. Числа можуть бути додатними чи від’ємними, і перше непослідовне також може бути будь-яким!
// function firstNonConsecutive(arr) {
//     if(arr.length<=1) return null
//   const a = arr[1] - arr[0];
//   for (let i = 0; i < arr.length; i++) {
//     if (arr[i + 1] !== arr[i] + a) {
//       console.log(arr[i + 1]);
//       return arr[i + 1] || null;
//     }
//   }
// }
// console.log(firstNonConsecutive([1, 2, 3, 4, 6, 7, 8]));
// console.log(firstNonConsecutive([1, 2, 3, 4, 6, 7, 8]));

// --5-- Нам потрібна функція, яка може перетворити рядок на число. Які шляхи досягнення цього ви знаєте?П
// const stringToNumber = function (str) {
//   return +str;
// };
// console.log(stringToNumber("1234"));
// console.log(stringToNumber("-7"));

--6--У вашому класі був контроль, і ви його склали. Щиро вітаю!Але ти амбітна людина. Ви хочете знати, чи ви кращий за середнього учня у вашому класі.Ви отримуєте масив із результатами тестів ваших однолітків. Тепер обчисліть середнє значення та порівняйте свій бал!Повертайся True, якщо тобі краще, інакше False!

function betterThanAverage(classPoints, yourPoints) {
  // Your code here
}

console.log(order("is2 Thi1s T4est 3a"));
console.log(order("4of Fo1r pe6ople g3ood th5e the2"));
