// ---1---Напишіть функцію, яка бере масив слів і розбиває їх разом у речення та повертає речення. Ви можете ігнорувати будь-яку необхідність дезінфекції слів або додавання розділових знаків, але ви повинні додавати пробіли між кожним словом. Будьте уважні, не повинно бути пробілів ні на початку, ні в кінці речення!

// function smash(words) {
//   return words.join(" ");
// }
// console.log(smash(["hello", "amazing", "world"]));

// ---2--- У цьому простому завданні вам дано число, і ви повинні зробити його від’ємним. Але, може, число вже негативне?
// function makeNegative(num) {
//   if (num <= 0) return num;
//   return num * -1;
// }
// console.log(makeNegative(42));
